ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="DEVCFGLOCK1" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Lock bit for PERxSYSCONFIG0-31 registers">
		<bitfield id="PER0SYSCONFIG" description="Lock bit for PER0SYSCONFIG register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PER1SYSCONFIG" description="Lock bit for PER1SYSCONFIG register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PER2SYSCONFIG" description="Lock bit for PER2SYSCONFIG register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PER3SYSCONFIG" description="Lock bit for PER3SYSCONFIG register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PER4SYSCONFIG" description="Lock bit for PER4SYSCONFIG register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PER5SYSCONFIG" description="Lock bit for PER5SYSCONFIG register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PER6SYSCONFIG" description="Lock bit for PER6SYSCONFIG register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PER7SYSCONFIG" description="Lock bit for PER7SYSCONFIG register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PER8SYSCONFIG" description="Lock bit for PER8SYSCONFIG register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PER9SYSCONFIG" description="Lock bit for PER9SYSCONFIG register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PER10SYSCONFIG" description="Lock bit for PER10SYSCONFIG register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PER11SYSCONFIG" description="Lock bit for PER11SYSCONFIG register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PER12SYSCONFIG" description="Lock bit for PER12SYSCONFIG register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PER13SYSCONFIG" description="Lock bit for PER13SYSCONFIG register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PER14SYSCONFIG" description="Lock bit for PER14SYSCONFIG register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PER15SYSCONFIG" description="Lock bit for PER15SYSCONFIG register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PER16SYSCONFIG" description="Lock bit for PER16SYSCONFIG register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PER17SYSCONFIG" description="Lock bit for PER17SYSCONFIG register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PER18SYSCONFIG" description="Lock bit for PER18SYSCONFIG register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PER19SYSCONFIG" description="Lock bit for PER19SYSCONFIG register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PER20SYSCONFIG" description="Lock bit for PER20SYSCONFIG register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PER21SYSCONFIG" description="Lock bit for PER21SYSCONFIG register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PER22SYSCONFIG" description="Lock bit for PER22SYSCONFIG register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PER23SYSCONFIG" description="Lock bit for PER23SYSCONFIG register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PER24SYSCONFIG" description="Lock bit for PER24SYSCONFIG register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PER25SYSCONFIG" description="Lock bit for PER25SYSCONFIG register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PER26SYSCONFIG" description="Lock bit for PER26SYSCONFIG register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PER27SYSCONFIG" description="Lock bit for PER27SYSCONFIG register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PER28SYSCONFIG" description="Lock bit for PER28SYSCONFIG register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PER29SYSCONFIG" description="Lock bit for PER29SYSCONFIG register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PER30SYSCONFIG" description="Lock bit for PER30SYSCONFIG register" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PER31SYSCONFIG" description="Lock bit for PER31SYSCONFIG register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK2" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Lock bit for DEVCFG registers">
		<bitfield id="SICCONFIG" description="Lock for SICCONFIG" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LSEN" description="Lock for LSEN" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCATCTL" description="Lock for ETHERCATCTL" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR22" description="Lock for PCLKCR22" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK3" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Lock bit for PERxSYSCONFIG32-63 registers">
		<bitfield id="PER32SYSCONFIG" description="Lock bit for PER32SYSCONFIG register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PER33SYSCONFIG" description="Lock bit for PER33SYSCONFIG register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PER34SYSCONFIG" description="Lock bit for PER34SYSCONFIG register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PER35SYSCONFIG" description="Lock bit for PER35SYSCONFIG register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PER36SYSCONFIG" description="Lock bit for PER36SYSCONFIG register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PER37SYSCONFIG" description="Lock bit for PER37SYSCONFIG register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PER38SYSCONFIG" description="Lock bit for PER38SYSCONFIG register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PER39SYSCONFIG" description="Lock bit for PER39SYSCONFIG register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PER40SYSCONFIG" description="Lock bit for PER40SYSCONFIG register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PER41SYSCONFIG" description="Lock bit for PER41SYSCONFIG register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PER42SYSCONFIG" description="Lock bit for PER42SYSCONFIG register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PER43SYSCONFIG" description="Lock bit for PER43SYSCONFIG register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PER44SYSCONFIG" description="Lock bit for PER44SYSCONFIG register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PER45SYSCONFIG" description="Lock bit for PER45SYSCONFIG register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PER46SYSCONFIG" description="Lock bit for PER46SYSCONFIG register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PER47SYSCONFIG" description="Lock bit for PER47SYSCONFIG register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PER48SYSCONFIG" description="Lock bit for PER48SYSCONFIG register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PER49SYSCONFIG" description="Lock bit for PER49SYSCONFIG register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PER50SYSCONFIG" description="Lock bit for PER50SYSCONFIG register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PER51SYSCONFIG" description="Lock bit for PER51SYSCONFIG register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PER52SYSCONFIG" description="Lock bit for PER52SYSCONFIG register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PER53SYSCONFIG" description="Lock bit for PER53SYSCONFIG register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PER54SYSCONFIG" description="Lock bit for PER54SYSCONFIG register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PER55SYSCONFIG" description="Lock bit for PER55SYSCONFIG register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PER56SYSCONFIG" description="Lock bit for PER56SYSCONFIG register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PER57SYSCONFIG" description="Lock bit for PER57SYSCONFIG register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PER58SYSCONFIG" description="Lock bit for PER58SYSCONFIG register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PER59SYSCONFIG" description="Lock bit for PER59SYSCONFIG register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PER60SYSCONFIG" description="Lock bit for PER60SYSCONFIG register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PER61SYSCONFIG" description="Lock bit for PER61SYSCONFIG register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PER62SYSCONFIG" description="Lock bit for PER62SYSCONFIG register" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PER63SYSCONFIG" description="Lock bit for PER63SYSCONFIG register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK4" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Lock bit for PERxSYSCONFIG64-95 registers">
		<bitfield id="PER64SYSCONFIG" description="Lock bit for PER64SYSCONFIG register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PER65SYSCONFIG" description="Lock bit for PER65SYSCONFIG register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PER66SYSCONFIG" description="Lock bit for PER66SYSCONFIG register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PER67SYSCONFIG" description="Lock bit for PER67SYSCONFIG register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PER68SYSCONFIG" description="Lock bit for PER68SYSCONFIG register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PER69SYSCONFIG" description="Lock bit for PER69SYSCONFIG register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PER70SYSCONFIG" description="Lock bit for PER70SYSCONFIG register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PER71SYSCONFIG" description="Lock bit for PER71SYSCONFIG register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PER72SYSCONFIG" description="Lock bit for PER72SYSCONFIG register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PER73SYSCONFIG" description="Lock bit for PER73SYSCONFIG register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PER74SYSCONFIG" description="Lock bit for PER74SYSCONFIG register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PER75SYSCONFIG" description="Lock bit for PER75SYSCONFIG register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PER76SYSCONFIG" description="Lock bit for PER76SYSCONFIG register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PER77SYSCONFIG" description="Lock bit for PER77SYSCONFIG register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PER78SYSCONFIG" description="Lock bit for PER78SYSCONFIG register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PER79SYSCONFIG" description="Lock bit for PER79SYSCONFIG register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PER80SYSCONFIG" description="Lock bit for PER80SYSCONFIG register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PER81SYSCONFIG" description="Lock bit for PER81SYSCONFIG register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PER82SYSCONFIG" description="Lock bit for PER82SYSCONFIG register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PER83SYSCONFIG" description="Lock bit for PER83SYSCONFIG register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PER84SYSCONFIG" description="Lock bit for PER84SYSCONFIG register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PER85SYSCONFIG" description="Lock bit for PER85SYSCONFIG register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PER86SYSCONFIG" description="Lock bit for PER86SYSCONFIG register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PER87SYSCONFIG" description="Lock bit for PER87SYSCONFIG register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PER88SYSCONFIG" description="Lock bit for PER88SYSCONFIG register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PER89SYSCONFIG" description="Lock bit for PER89SYSCONFIG register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PER90SYSCONFIG" description="Lock bit for PER90SYSCONFIG register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PER91SYSCONFIG" description="Lock bit for PER91SYSCONFIG register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PER92SYSCONFIG" description="Lock bit for PER92SYSCONFIG register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PER93SYSCONFIG" description="Lock bit for PER93SYSCONFIG register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PER94SYSCONFIG" description="Lock bit for PER94SYSCONFIG register" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PER95SYSCONFIG" description="Lock bit for PER95SYSCONFIG register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK5" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Lock bit for PERxSYSCONFIG96-127 registers">
		<bitfield id="PER96SYSCONFIG" description="Lock bit for PER96SYSCONFIG register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PER97SYSCONFIG" description="Lock bit for PER97SYSCONFIG register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PER98SYSCONFIG" description="Lock bit for PER98SYSCONFIG register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PER99SYSCONFIG" description="Lock bit for PER99SYSCONFIG register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PER100SYSCONFIG" description="Lock bit for PER100SYSCONFIG register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PER101SYSCONFIG" description="Lock bit for PER101SYSCONFIG register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PER102SYSCONFIG" description="Lock bit for PER102SYSCONFIG register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PER103SYSCONFIG" description="Lock bit for PER103SYSCONFIG register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PER104SYSCONFIG" description="Lock bit for PER104SYSCONFIG register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PER105SYSCONFIG" description="Lock bit for PER105SYSCONFIG register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PER106SYSCONFIG" description="Lock bit for PER106SYSCONFIG register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PER107SYSCONFIG" description="Lock bit for PER107SYSCONFIG register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PER108SYSCONFIG" description="Lock bit for PER108SYSCONFIG register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PER109SYSCONFIG" description="Lock bit for PER109SYSCONFIG register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PER110SYSCONFIG" description="Lock bit for PER110SYSCONFIG register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PER111SYSCONFIG" description="Lock bit for PER111SYSCONFIG register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PER112SYSCONFIG" description="Lock bit for PER112SYSCONFIG register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PER113SYSCONFIG" description="Lock bit for PER113SYSCONFIG register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PER114SYSCONFIG" description="Lock bit for PER114SYSCONFIG register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PER115SYSCONFIG" description="Lock bit for PER115SYSCONFIG register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PER116SYSCONFIG" description="Lock bit for PER116SYSCONFIG register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PER117SYSCONFIG" description="Lock bit for PER117SYSCONFIG register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PER118SYSCONFIG" description="Lock bit for PER118SYSCONFIG register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PER119SYSCONFIG" description="Lock bit for PER119SYSCONFIG register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PER120SYSCONFIG" description="Lock bit for PER120SYSCONFIG register" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK6" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Lock bit for PERxSYSCONFIG128-159 registers">
	</register>
	<register id="PARTIDL" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="FLASH_SIZE" description="FLASH_SIZE" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="PARTID_FORMAT_REV" description="PARTID_FORMAT_REV" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
