ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="PARTIDH" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="REVID" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID. This is specific to the Device" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MCUCNF1" width="32" page="0" offset="0x1c0" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: EMIF Customization">
		<bitfield id="EMIF1" description="EMIF1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF2" width="32" page="0" offset="0x1c4" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: EPWM">
		<bitfield id="EPWM1" description="EPWM1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 Present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 Present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 Present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 Present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 Present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 Present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 Present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 Present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 Present" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="EPWM17 Present" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="EPWM18 Present" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF4" width="32" page="0" offset="0x1cc" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: EQEP">
		<bitfield id="EQEP1" description="EQEP1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EQEP4" description="EQEP4 Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EQEP5" description="EQEP5 Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EQEP6" description="EQEP6 Present" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF7" width="32" page="0" offset="0x1d8" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: UART">
		<bitfield id="UART_A" description="UART_A Present" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="UART_B" description="UART_B Present" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="UART_C" description="UART_C Present" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="UART_D" description="UART_D Present" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="UART_E" description="UART_E Present" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="UART_F" description="UART_F Present" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF10" width="32" page="0" offset="0x1e4" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: CAN, MCAN">
		<bitfield id="MCAN_A" description="MCAN_A Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_C" description="MCAN_C Present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_D" description="MCAN_D Present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_E" description="MCAN_E Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_F" description="MCAN_F Present" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF13" width="32" page="0" offset="0x1f0" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: AMCUCNF">
		<bitfield id="ADC_A" description="ADC_A Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E Present" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF14" width="32" page="0" offset="0x1f4" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: CMPSS">
		<bitfield id="CMPSS1" description="CMPSS1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 Present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 Present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9" description="CMPSS9 Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10" description="CMPSS10 Present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11" description="CMPSS11 Present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12" description="CMPSS12 Present" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF16" width="32" page="0" offset="0x1fc" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: DAC">
		<bitfield id="DAC_A" description="DAC_A Present" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="DAC_B Present" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF17" width="32" page="0" offset="0x200" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: CLB">
		<bitfield id="CLB1" description="CLB1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB5" description="CLB5 Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB6" description="CLB6 Present" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
