ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="MCUCNF18" width="32" page="0" offset="0x204" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FSI">
		<bitfield id="FSITX_A" description="FSITX_A  Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B  Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_C" description="FSITX_C  Present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_D" description="FSITX_D  Present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A  Present" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B  Present" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C  Present" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D  Present" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF19" width="32" page="0" offset="0x208" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: LIN">
		<bitfield id="LIN_A" description="LIN_A Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B Present" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF23" width="32" page="0" offset="0x218" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: EtherCAT">
		<bitfield id="ETHERCAT" description="ETHERCAT" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF26" width="32" page="0" offset="0x224" instances="1" instaddr="4" internal="0" description="Device Capability: HSM-Crypto Engines AES, SHA, PKA, TRNG">
		<bitfield id="AES" description="AES Present" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="SHA" description="SHA Present" begin="11" end="6" width="6" rwaccess="RW"/>
		<bitfield id="PKA" description="PKA Present" begin="17" end="12" width="6" rwaccess="RW"/>
		<bitfield id="TRNG" description="TRNG Present" begin="23" end="18" width="6" rwaccess="RW"/>
	</register>
	<register id="MCUCNF31" width="32" page="0" offset="0x238" instances="1" instaddr="4" internal="0" description="Device Capability: HSM-Crypto Engines SM2, SM3, SM4">
		<bitfield id="SM2" description="SM2 Present" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="SM3" description="SM3 Present" begin="11" end="6" width="6" rwaccess="RW"/>
		<bitfield id="SM4" description="SM4 Present" begin="17" end="12" width="6" rwaccess="RW"/>
	</register>
	<register id="MCUCNF64" width="32" page="0" offset="0x2bc" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: MCUCNF level, Processing Block, RTDMA Customization">
		<bitfield id="CPU2" description="CPU2SS Present on this device" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPU3" description="CPU3SS Present on this device" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF65" width="32" page="0" offset="0x2c0" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: On-chip SRAM Customization">
		<bitfield id="CPA0" description="CPA0 Memory Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPA1" description="CPA1 Memory Present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="LPA0" description="LPA0 Memory Present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="LPA1" description="LPA1 Memory Present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="LDA0" description="LDA0 Memory Present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LDA1" description="LDA1 Memory Present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="LDA2" description="LDA2 Memory Present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="LDA3" description="LDA3 Memory Present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="LDA4" description="LDA4 Memory Present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="LDA5" description="LDA5 Memory Present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="LDA6" description="LDA6 Memory Present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="LDA7" description="LDA7 Memory Present" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CDA0" description="CDA0 Memory Present" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CDA1" description="CDA1 Memory Present" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CDA2" description="CDA2 Memory Present" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CDA3" description="CDA3 Memory Present" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CDA4" description="CDA4 Memory Present" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CDA5" description="CDA5 Memory Present" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CDA6" description="CDA6 Memory Present" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CDA7" description="CDA7 Memory Present" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CDA8" description="CDA8 Memory Present" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CDA9" description="CDA9 Memory Present" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CDA10" description="CDA10 Memory Present" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CDA11" description="CDA11 Memory Present" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF74" width="32" page="0" offset="0x2e4" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FLC1.B0/B1">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_128" description="Flash sectors 143_128 present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_144" description="Flash sectors 159_144 present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_160" description="Flash sectors 175_160 present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_176" description="Flash sectors 191_176 present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_192" description="Flash sectors 207_192 present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_208" description="Flash sectors 223_208 present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_224" description="Flash sectors 239_224 present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_240" description="Flash sectors 255_240 present" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
