ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="MCUCNF76" width="32" page="0" offset="0x2ec" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FLC1.B2/B3">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_128" description="Flash sectors 143_128 present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_144" description="Flash sectors 159_144 present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_160" description="Flash sectors 175_160 present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_176" description="Flash sectors 191_176 present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_192" description="Flash sectors 207_192 present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_208" description="Flash sectors 223_208 present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_224" description="Flash sectors 239_224 present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_240" description="Flash sectors 255_240 present" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF78" width="32" page="0" offset="0x2f4" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FLC1.B4 256KB Data Flash">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF79" width="32" page="0" offset="0x2f8" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FLC2.B0/B1">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_128" description="Flash sectors 143_128 present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_144" description="Flash sectors 159_144 present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_160" description="Flash sectors 175_160 present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_176" description="Flash sectors 191_176 present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_192" description="Flash sectors 207_192 present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_208" description="Flash sectors 223_208 present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_224" description="Flash sectors 239_224 present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_240" description="Flash sectors 255_240 present" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF81" width="32" page="0" offset="0x300" instances="1" instaddr="4" internal="0" description="MCUCNF Capability: FLC2.B2/B3">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SECT143_128" description="Flash sectors 143_128 present" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SECT159_144" description="Flash sectors 159_144 present" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SECT175_160" description="Flash sectors 175_160 present" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SECT191_176" description="Flash sectors 191_176 present" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SECT207_192" description="Flash sectors 207_192 present" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SECT223_208" description="Flash sectors 223_208 present" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SECT239_224" description="Flash sectors 239_224 present" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SECT255_240" description="Flash sectors 255_240 present" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
