ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="MCUCNFLOCK1" width="32" page="0" offset="0x33c" instances="1" instaddr="4" internal="0" description="Lock bit for MCUCNFx registers">
		<bitfield id="MCUCNF1" description="Lock bit for MCUCNF1 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF2" description="Lock bit for MCUCNF2 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF4" description="Lock bit for MCUCNF4 register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF10" description="Lock bit for MCUCNF10 register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF17" description="Lock bit for MCUCNF17 register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF18" description="Lock bit for MCUCNF18 register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF19" description="Lock bit for MCUCNF19 register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF23" description="Lock bit for MCUCNF23 register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF26" description="Lock bit for MCUCNF26 register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF31" description="Lock bit for MCUCNF31 register" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNFLOCK2" width="32" page="0" offset="0x340" instances="1" instaddr="4" internal="0" description="Lock bit for MCUCNFx registers">
	</register>
	<register id="MCUCNFLOCK3" width="32" page="0" offset="0x344" instances="1" instaddr="4" internal="0" description="Lock bit for MCUCNFx registers">
		<bitfield id="MCUCNF64" description="Lock bit for MCUCNF64 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF65" description="Lock bit for MCUCNF65 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF74" description="Lock bit for MCUCNF74 register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF76" description="Lock bit for MCUCNF76 register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF78" description="Lock bit for MCUCNF78 register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF79" description="Lock bit for MCUCNF79 register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF81" description="Lock bit for MCUCNF81 register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF95" description="Lock bit for MCUCNF95 register" begin="30" end="30" width="1" rwaccess="RW"/>
	</register>
	<register id="LSEN" width="32" page="0" offset="0x348" instances="1" instaddr="4" internal="0" description="Lockstep enable configuration">
		<bitfield id="Enable" description="Lockstep Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="Rserved" description="Reserved" begin="31" end="1" width="31" rwaccess="R"/>
	</register>
	<register id="EPWMXLINKCFG" width="32" page="0" offset="0x37c" instances="1" instaddr="4" internal="0" description="Configure which EPWM module instaces are linked in the XLINK scheme">
		<bitfield id="EPWM1" description="Enable EPWM1 instance for the XLINK feature" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="Enable EPWM2 instance for the XLINK feature" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="Enable EPWM3 instance for the XLINK feature" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="Enable EPWM4 instance for the XLINK feature" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="Enable EPWM5 instance for the XLINK feature" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="Enable EPWM6 instance for the XLINK feature" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="Enable EPWM7 instance for the XLINK feature" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="Enable EPWM8 instance for the XLINK feature" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="Enable EPWM9 instance for the XLINK feature" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="Enable EPWM10 instance for the XLINK feature" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="Enable EPWM11 instance for the XLINK feature" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="Enable EPWM12 instance for the XLINK feature" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="Enable EPWM13 instance for the XLINK feature" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="Enable EPWM14 instance for the XLINK feature" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="Enable EPWM15 instance for the XLINK feature" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="Enable EPWM16 instance for the XLINK feature" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="Enable EPWM17 instance for the XLINK feature" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="Enable EPWM18 instance for the XLINK feature" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SICCONFIG" width="32" page="0" offset="0x384" instances="1" instaddr="4" internal="0" description="Safety Interconnect(SIC) Configuration - Enable and READY TIMEOUT value">
		<bitfield id="Enable" description="Safety Interconnect Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TIMEOUT" description="Safety Interconnect (SIC) READY TUMEOUT" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RSTSTAT" width="32" page="0" offset="0x3b0" instances="1" instaddr="4" internal="0" description="Reset Status register for secondary CPUs">
		<bitfield id="CPU2" description="CPU2 Reset Status bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPU3" description="CPU3 Reset Status bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
