ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="LPMSTAT" width="32" page="0" offset="0x3b4" instances="1" instaddr="4" internal="0" description="LPM Status Register for secondary CPUs">
		<bitfield id="CPU2" description="CPU2 LPM Status" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="CPU3" description="CPU3 LPM Status" begin="3" end="2" width="2" rwaccess="R"/>
	</register>
	<register id="TAP_STATUS" width="32" page="0" offset="0x3cc" instances="1" instaddr="4" internal="0" description="Status of JTAG State machine and Debugger Connect">
		<bitfield id="TAP_STATE" description="Present TAP State" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger Connect Indication" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="TAP_CONTROL" width="32" page="0" offset="0x3d0" instances="1" instaddr="4" internal="0" description="Disable TAP control">
		<bitfield id="BSCAN_DIS" description="Disable BSCAN TAP control" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key value to enable write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="DEVLIFECYCLE" width="32" page="0" offset="0x3d4" instances="1" instaddr="4" internal="0" description="Reflect the state of the Device Life Cycle signals reported from the HSM">
		<bitfield id="DEVTYPE" description="These bits reflect the state from HSM DEVICE_TYPE" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="HSSUBTYPE" description="These bits reflect the state from the HSM HS_SUBTYPE" begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="SDFMTYPE" width="32" page="0" offset="0x47c" instances="1" instaddr="4" internal="0" description="Configures SDFM Type for the device">
		<bitfield id="TYPE" description="Configure SDFM type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SYNCSELECT" width="32" page="0" offset="0x4ac" instances="1" instaddr="4" internal="0" description="Sync Input and Output Select Register">
		<bitfield id="SYNCOUT" description="Select Syncout Source" begin="28" end="24" width="5" rwaccess="RW"/>
	</register>
	<register id="ADCSOCOUTSELECT" width="32" page="0" offset="0x4b0" instances="1" instaddr="4" internal="0" description="External ADCSOC Select Register (PWM1-16)">
		<bitfield id="PWM1SOCAEN" description="PWM1SOCAEN Enable for ADCSOCAOn " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PWM2SOCAEN" description="PWM2SOCAEN Enable for ADCSOCAOn " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PWM3SOCAEN" description="PWM3SOCAEN Enable for ADCSOCAOn " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PWM4SOCAEN" description="PWM4SOCAEN Enable for ADCSOCAOn " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PWM5SOCAEN" description="PWM5SOCAEN Enable for ADCSOCAOn " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PWM6SOCAEN" description="PWM6SOCAEN Enable for ADCSOCAOn " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PWM7SOCAEN" description="PWM7SOCAEN Enable for ADCSOCAOn " begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PWM8SOCAEN" description="PWM8SOCAEN Enable for ADCSOCAOn " begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PWM9SOCAEN" description="PWM9SOCAEN Enable for ADCSOCAOn " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PWM10SOCAEN" description="PWM10SOCAEN Enable for ADCSOCAOn " begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PWM11SOCAEN" description="PWM11SOCAEN Enable for ADCSOCAOn " begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PWM12SOCAEN" description="PWM12SOCAEN Enable for ADCSOCAOn " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PWM13SOCAEN" description="PWM13SOCAEN Enable for ADCSOCAOn " begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PWM14SOCAEN" description="PWM14SOCAEN Enable for ADCSOCAOn " begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PWM15SOCAEN" description="PWM15SOCAEN Enable for ADCSOCAOn " begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PWM16SOCAEN" description="PWM16SOCAEN Enable for ADCSOCAOn " begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="PWM1SOCBEN" description="PWM1SOCBEN Enable for ADCSOCBOn " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PWM2SOCBEN" description="PWM2SOCBEN Enable for ADCSOCBOn " begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PWM3SOCBEN" description="PWM3SOCBEN Enable for ADCSOCBOn " begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="PWM4SOCBEN" description="PWM4SOCBEN Enable for ADCSOCBOn " begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PWM5SOCBEN" description="PWM5SOCBEN Enable for ADCSOCBOn " begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="PWM6SOCBEN" description="PWM6SOCBEN Enable for ADCSOCBOn " begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="PWM7SOCBEN" description="PWM7SOCBEN Enable for ADCSOCBOn " begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="PWM8SOCBEN" description="PWM8SOCBEN Enable for ADCSOCBOn " begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PWM9SOCBEN" description="PWM9SOCBEN Enable for ADCSOCBOn " begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PWM10SOBAEN" description="PWM10SOBAEN Enable for ADCSOCBOn " begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PWM11SOBAEN" description="PWM11SOBAEN Enable for ADCSOCBOn " begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PWM12SOBAEN" description="PWM12SOBAEN Enable for ADCSOCBOn " begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="PWM13SOCBEN" description="PWM13SOCBEN Enable for ADCSOCBOn " begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PWM14SOBAEN" description="PWM14SOBAEN Enable for ADCSOCBOn " begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PWM15SOBAEN" description="PWM15SOBAEN Enable for ADCSOCBOn " begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="PWM16SOBAEN" description="PWM16SOBAEN Enable for ADCSOCBOn " begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCOUTSELECT1" width="32" page="0" offset="0x4b4" instances="1" instaddr="4" internal="0" description="External ADCSOC Select Register (PWM17-32)">
		<bitfield id="PWM17SOCAEN" description="PWM17SOCAEN Enable for ADCSOCAOn " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PWM18SOCAEN" description="PWM18SOCAEN Enable for ADCSOCAOn " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PWM17SOCBEN" description="PWM17SOCBEN Enable for ADCSOCBOn " begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PWM18SOCBEN" description="PWM18SOCBEN Enable for ADCSOCBOn " begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SYNCSOCLOCK" width="32" page="0" offset="0x4b8" instances="1" instaddr="4" internal="0" description="SYNCSEL and ADCSOC Select Lock register">
		<bitfield id="SYNCSELECT" description="SYNCSEL Register Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCOUTSELECT" description="ADCSOCOUTSELECT Register Lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCOUTSELECT1" description="ADCSOCOUTSELECT1 Register Lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="HSMTOCPU_STS1" width="32" page="0" offset="0x4dc" instances="1" instaddr="4" internal="0" description="HSM to C29x Signal Status1">
		<bitfield id="SRAM_BANK0" description="HSM to CPU USURP Communication Signal for SRAM_BANK0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK1" description="HSM to CPU USURP Communication Signal for SRAM_BANK1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK2" description="HSM to CPU USURP Communication Signal for SRAM_BANK2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK3" description="HSM to CPU USURP Communication Signal for SRAM_BANK3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK4" description="HSM to CPU USURP Communication Signal for SRAM_BANK4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK5" description="HSM to CPU USURP Communication Signal for SRAM_BANK5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK6" description="HSM to CPU USURP Communication Signal for SRAM_BANK6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SRAM_BANK7" description="HSM to CPU USURP Communication Signal for SRAM_BANK7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="FLC1" description="HSM to CPU USURP Communication Signal for FLC1" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="FLC2" description="HSM to CPU USURP Communication Signal for FLC2" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="LPOST" description="HSM to CPU USURP Communication Signal for LPOST" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MPOST" description="HSM to CPU USURP Communication Signal for MPOST" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC_GENR_1" description="HSM to CPU USURP Communication Signal for SOC_GENR_1" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="SOC_GENR_2" description="HSM to CPU USURP Communication Signal for SOC_GENR_2" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="HSMTOCPU_STS2" width="32" page="0" offset="0x4e0" instances="1" instaddr="4" internal="0" description="HSM to C29x Signal Status2">
		<bitfield id="FLC1_BANK0" description="HSM to CPU USURP Communication Signal for FLC1_BANK0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FLC2_BANK0" description="HSM to CPU USURP Communication Signal for FLC2_BANK0" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FLC1_BANK1" description="HSM to CPU USURP Communication Signal for FLC1_BANK1" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FLC2_BANK1" description="HSM to CPU USURP Communication Signal for FLC2_BANK1" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="FLC1_BANK2" description="HSM to CPU USURP Communication Signal for FLC1_BANK2" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="FLC2_BANK2" description="HSM to CPU USURP Communication Signal for FLC2_BANK2" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="FLC1_BANK3" description="HSM to CPU USURP Communication Signal for FLC1_BANK3" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="FLC2_BANK3" description="HSM to CPU USURP Communication Signal for FLC2_BANK3" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="FLC1_BANK4" description="HSM to CPU USURP Communication Signal for FLC1_BANK4" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="FLC2_BANK4" description="HSM to CPU USURP Communication Signal for FLC2_BANK4" begin="24" end="24" width="1" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG0" width="32" page="0" offset="0x4e4" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
