ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="HSM_SECURE_BOOT_INFO_REG1" width="32" page="0" offset="0x4e8" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG2" width="32" page="0" offset="0x4ec" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG3" width="32" page="0" offset="0x4f0" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG4" width="32" page="0" offset="0x4f4" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG5" width="32" page="0" offset="0x4f8" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG6" width="32" page="0" offset="0x4fc" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="HSM_SECURE_BOOT_INFO_REG7" width="32" page="0" offset="0x500" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process HSM to CPU1">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG0" width="32" page="0" offset="0x504" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG1" width="32" page="0" offset="0x508" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG2" width="32" page="0" offset="0x50c" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG3" width="32" page="0" offset="0x510" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG4" width="32" page="0" offset="0x514" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG5" width="32" page="0" offset="0x518" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG6" width="32" page="0" offset="0x51c" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SOC_SECURE_BOOT_INFO_REG7" width="32" page="0" offset="0x520" instances="1" instaddr="4" internal="0" description="Status information of the secure boot process CPU1 to HSM">
		<bitfield id="STATUS" description="Status information of the secure boot process" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CLKCFGLOCK1" width="32" page="0" offset="0x524" instances="1" instaddr="4" internal="0" description="Lock bit for CLKCFG registers">
		<bitfield id="CLKSRCCTL1" description="Lock bit for CLKSRCCTL1 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL2" description="Lock bit for CLKSRCCTL2 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLKSRCCTL3" description="Lock bit for CLKSRCCTL3 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLCTL1" description="Lock bit for SYSPLLCTL1 register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SYSPLLMULT" description="Lock bit for SYSPLLMULT register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SYSCLKDIVSEL" description="Lock bit for SYSCLKDIVSEL register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PERCLKDIVSEL" description="Lock bit for PERCLKDIVSEL register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLBCLKCTL" description="Lock bit for CLBCLKCTL register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="XTALCR" description="Lock bit for XTALCR  and XTALCR2 register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EXTRFLTDET" description="Lockbit for EXTRFLTDET register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ETHERCATCLKCTL" description="Lockbit for ETHERCATCLKCTL register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="HSMCLKDIVSEL" description="Lock bit for HSMCLKDIVSEL register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MCANCLKDIVSEL" description="Lock bit for MCANCLKDIVSEL register" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="XCLKOUTDIVSEL" description="Lock bit for XCLKOUTDIVSEL register" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL1" width="32" page="0" offset="0x530" instances="1" instaddr="4" internal="0" description="Clock Source Control register-1">
		<bitfield id="OSCCLKSRCSEL" description="OSCCLK Source Select Bit" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="CLKSRCCTL2" width="32" page="0" offset="0x534" instances="1" instaddr="4" internal="0" description="Clock Source Control register-2">
		<bitfield id="MCANABCLKSEL" description="MCANA Bit Clock Source Select Bit" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MCANBBCLKSEL" description="MCANB Bit Clock Source Select Bit" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MCANCBCLKSEL" description="MCANC Bit Clock Source Select Bit" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MCANDBCLKSEL" description="MCAND Bit Clock Source Select Bit" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MCANEBCLKSEL" description="MCANE Bit Clock Source Select Bit" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MCANFBCLKSEL" description="MCANF Bit Clock Source Select Bit" begin="21" end="20" width="2" rwaccess="RW"/>
	</register>
