ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="CLKSRCCTL3" width="32" page="0" offset="0x538" instances="1" instaddr="4" internal="0" description="Clock Source Control register-3">
		<bitfield id="XCLKOUTSEL" description="XCLKOUT Source Select Bit" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="SYSPLLCTL1" width="32" page="0" offset="0x53c" instances="1" instaddr="4" internal="0" description="SYSPLL Control register-1">
		<bitfield id="PLLEN" description="SYSPLL enable/disable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PLLCLKEN" description="SYSPLL bypassed or included in the PLLSYSCLK path" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SYSPLLMULT" width="32" page="0" offset="0x548" instances="1" instaddr="4" internal="0" description="SYSPLL Multiplier register">
		<bitfield id="IMULT" description="SYSPLL Integer Multiplier" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="ODIV" description="Output Clock Divider" begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="REFDIV" description="Reference Clock Divider" begin="28" end="24" width="5" rwaccess="RW"/>
	</register>
	<register id="SYSPLLSTS" width="32" page="0" offset="0x54c" instances="1" instaddr="4" internal="0" description="SYSPLL Status register">
		<bitfield id="LOCKS" description="SYSPLL Lock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SLIPS" description="SYSPLL Slip Status Bit" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="SYSCLKDIVSEL" width="32" page="0" offset="0x564" instances="1" instaddr="4" internal="0" description="System Clock Divider Select register">
		<bitfield id="PLLSYSCLKDIV" description="PLLSYSCLK Divide Select" begin="5" end="0" width="6" rwaccess="RW"/>
	</register>
	<register id="PERCLKDIVSEL" width="32" page="0" offset="0x56c" instances="1" instaddr="4" internal="0" description="Peripheral Clock Divider Select register">
		<bitfield id="EPWMCLKDIV" description="EPWM Clock Divide Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EMIF1CLKDIV" description="EMIF1  Clock Divide Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="LINACLKDIV" description="LINA Clock Divide Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="LINBCLKDIV" description="LINB Clock Divide Select" begin="12" end="11" width="2" rwaccess="RW"/>
	</register>
	<register id="XCLKOUTDIVSEL" width="32" page="0" offset="0x570" instances="1" instaddr="4" internal="0" description="XCLKOUT Divider Select register">
		<bitfield id="XCLKOUTDIV" description="XCLKOUT Divide Select" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="HSMCLKDIVSEL" width="32" page="0" offset="0x574" instances="1" instaddr="4" internal="0" description="HSM SYSCLK Divider Select register">
		<bitfield id="HSMCLKDIV" description="Divider value for HSMSYSCLK clock input to HSM" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="MCANCLKDIVSEL" width="32" page="0" offset="0x578" instances="1" instaddr="4" internal="0" description="MCAN Bit Clock Divider Select register">
		<bitfield id="MCANACLKDIV" description="Divider CANFD Bit CLK for MCANA" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="MCANBCLKDIV" description="Divider CANFD Bit CLK for MCANB" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="MCANCCLKDIV" description="Divider CANFD Bit CLK for MCANC" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="MCANDCLKDIV" description="Divider CANFD Bit CLK for MCAND" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="MCANECLKDIV" description="Divider CANFD Bit CLK for MCANE" begin="24" end="20" width="5" rwaccess="RW"/>
		<bitfield id="MCANFCLKDIV" description="Divider CANFD Bit CLK for MCANF" begin="29" end="25" width="5" rwaccess="RW"/>
	</register>
	<register id="CLBCLKCTL" width="32" page="0" offset="0x57c" instances="1" instaddr="4" internal="0" description="CLB Clocking Control Register">
		<bitfield id="CLBCLKDIV" description="CLB clock divider configuration." begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TILECLKDIV" description="CLB Tile clock divider configuration." begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB1" description="Clock mode of CLB1" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB2" description="Clock mode of CLB2" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB3" description="Clock mode of CLB3" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB4" description="Clock mode of CLB4" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB5" description="Clock mode of CLB5" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLKMODECLB6" description="Clock mode of CLB6" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="MCDCR" width="32" page="0" offset="0x584" instances="1" instaddr="4" internal="0" description="Missing Clock Detect Control Register">
		<bitfield id="MCLKSTS" description="Missing Clock Status Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MCLKCLR" description="Missing Clock Clear Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCLKOFF" description="Missing Clock Detect Off Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OSCOFF" description="Oscillator Clock Off Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SYSREF_LOSTS" description="SYSPLL Reference  Lost Status Bit" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SYSREF_LOSTSCLR" description="Clear for Ref clock lost status " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SYSREF_LOST_MCD_EN" description="Enable for PLL REF_CLK_LOST as MCD cause" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EXTR_FAULTS" description="External Resistor fault indication" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXTR_FAULTSCLR" description="External Resistor fault status clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EXTR_FAULT_MCD_EN" description="Configuration to enable EXTR_FAULTS as MCD cause" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
