ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="X1CNT" width="32" page="0" offset="0x588" instances="1" instaddr="4" internal="0" description="10-bit Counter on X1 Clock">
		<bitfield id="X1CNT" description="X1 Counter" begin="10" end="0" width="11" rwaccess="R"/>
		<bitfield id="CLR" description="X1 Counter Clear" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="XTALCR" width="32" page="0" offset="0x58c" instances="1" instaddr="4" internal="0" description="XTAL Control Register">
		<bitfield id="OSCOFF" description="XTAL Oscillator powered-down" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SE" description="XTAL Oscilator in Single-Ended mode" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="XTALCR2" width="32" page="0" offset="0x59c" instances="1" instaddr="4" internal="0" description="XTAL Control Register for pad init">
		<bitfield id="XIF" description="XI Initial value deposited before XOSC start" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XOF" description="XO Initial value deposited before XOSC start" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FEN" description="XOSC pads initialisation enable" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCATCLKCTL" width="32" page="0" offset="0x5a8" instances="1" instaddr="4" internal="0" description="EtherCAT Clock Control">
		<bitfield id="ECATDIV" description="etherCAT clock divider configuration." begin="3" end="1" width="3" rwaccess="RW"/>
		<bitfield id="PHYCLKEN" description="etherCAT PHY clock enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCATCTL" width="32" page="0" offset="0x5ac" instances="1" instaddr="4" internal="0" description="ETHERCAT control register.">
		<bitfield id="I2CLOOPBACK" description="Loopback I2C port of etherCAT IP to I2C_A." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SYNCBUSY" width="32" page="0" offset="0x5b0" instances="1" instaddr="4" internal="0" description="Pulse Transfer Sync Busy Status register">
		<bitfield id="BUSY" description="Status bit indicating synchronization in progress" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MCANCLKDIVSEL" description="BUSY status bit for MCANCLKDIVSEL" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CLBCLKCTL" description="BUSY status bit for CLBCLKCTL" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ETHERCATCLKCTL" description="BUSY status bit for ETHERCATCLKCTL" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="PERCLKDIVSEL" description="BUSY status bit for PERCLKDIVSEL" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SYSCLKDIVSEL" description="BUSY status bit for SYSCLKDIVSEL" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SYSPLLCTL1" description="BUSY status bit for SYSPLLCTL1" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SYSPLLMULT" description="BUSY status bit for SYSPLLMULT" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="XCLKOUTDIVSEL" description="BUSY status bit for XCLKOUTDIVSEL" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="XTALCR" description="BUSY status bit for XTALCR" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CLKSRCCTL1" description="BUSY status bit for CLKSRCCTL1" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CLKSRCCTL2" description="BUSY status bit for CLKSRCCTL2" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CLKSRCCTL3" description="BUSY status bit for CLKSRCCTL3" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CPU3TMR2CTL" description="BUSY status bit for CPU3TMR2CTL" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="CPU1TMR2CTL" description="BUSY status bit for CPU1TMR2CTL" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CPU2TMR2CTL" description="BUSY status bit for CPU2TMR2CTL" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="ESMXRSNCTL" width="32" page="0" offset="0x5c0" instances="1" instaddr="4" internal="0" description="Enable ESM reset outputs for XRSn">
		<bitfield id="ESMCPU1CRITICAL" description="Enable ESMCPU1CRITICAL to cause XRSn" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ESMCPU2CRITICAL" description="Enable ESMCPU2CRITICAL to cause XRSn" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ESMCPU2HIPRIWD" description="Enable ESMCPU2HIPRIWD to cause XRSn" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ESMCPU3CRITICAL" description="Enable ESMCPU3CRITICAL to cause XRSn" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ESMCPU3HIPRIWD" description="Enable ESMCPU3HIPRIWD to cause XRSn" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ESMRESET" description="Enable ESMRESET to cause XRSn" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWM1" width="32" page="0" offset="0x5c8" instances="1" instaddr="4" internal="0" description="PER2SYSCONFIG -  Peripheral System Configuration for EPWM1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWM2" width="32" page="0" offset="0x5cc" instances="1" instaddr="4" internal="0" description="PER3SYSCONFIG -  Peripheral System Configuration for EPWM2">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
