ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="SPID" width="32" page="0" offset="0x684" instances="1" instaddr="4" internal="0" description="PER49SYSCONFIG -  Peripheral System Configuration for SPID">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SPIE" width="32" page="0" offset="0x688" instances="1" instaddr="4" internal="0" description="PER50SYSCONFIG -  Peripheral System Configuration for SPIE">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CA" width="32" page="0" offset="0x68c" instances="1" instaddr="4" internal="0" description="PER51SYSCONFIG -  Peripheral System Configuration for I2CA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="I2CB" width="32" page="0" offset="0x690" instances="1" instaddr="4" internal="0" description="PER52SYSCONFIG -  Peripheral System Configuration for I2CB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBUSA" width="32" page="0" offset="0x694" instances="1" instaddr="4" internal="0" description="PER53SYSCONFIG -  Peripheral System Configuration for PMBUSA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LINA" width="32" page="0" offset="0x698" instances="1" instaddr="4" internal="0" description="PER54SYSCONFIG -  Peripheral System Configuration for LINA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="LINB" width="32" page="0" offset="0x69c" instances="1" instaddr="4" internal="0" description="PER55SYSCONFIG -  Peripheral System Configuration for LINB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANA" width="32" page="0" offset="0x6a0" instances="1" instaddr="4" internal="0" description="PER56SYSCONFIG -  Peripheral System Configuration for MCANA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANB" width="32" page="0" offset="0x6a4" instances="1" instaddr="4" internal="0" description="PER57SYSCONFIG -  Peripheral System Configuration for MCANB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANC" width="32" page="0" offset="0x6a8" instances="1" instaddr="4" internal="0" description="PER58SYSCONFIG -  Peripheral System Configuration for MCANC">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAND" width="32" page="0" offset="0x6ac" instances="1" instaddr="4" internal="0" description="PER59SYSCONFIG -  Peripheral System Configuration for MCAND">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
