ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="CMPSS3" width="32" page="0" offset="0x6d4" instances="1" instaddr="4" internal="0" description="PER69SYSCONFIG -  Peripheral System Configuration for CMPSS3">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS4" width="32" page="0" offset="0x6d8" instances="1" instaddr="4" internal="0" description="PER70SYSCONFIG -  Peripheral System Configuration for CMPSS4">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS5" width="32" page="0" offset="0x6dc" instances="1" instaddr="4" internal="0" description="PER71SYSCONFIG -  Peripheral System Configuration for CMPSS5">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS6" width="32" page="0" offset="0x6e0" instances="1" instaddr="4" internal="0" description="PER72SYSCONFIG -  Peripheral System Configuration for CMPSS6">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS7" width="32" page="0" offset="0x6e4" instances="1" instaddr="4" internal="0" description="PER73SYSCONFIG -  Peripheral System Configuration for CMPSS7">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS8" width="32" page="0" offset="0x6e8" instances="1" instaddr="4" internal="0" description="PER74SYSCONFIG -  Peripheral System Configuration for CMPSS8">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS9" width="32" page="0" offset="0x6ec" instances="1" instaddr="4" internal="0" description="PER75SYSCONFIG -  Peripheral System Configuration for CMPSS9">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS10" width="32" page="0" offset="0x6f0" instances="1" instaddr="4" internal="0" description="PER76SYSCONFIG -  Peripheral System Configuration for CMPSS10">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS11" width="32" page="0" offset="0x6f4" instances="1" instaddr="4" internal="0" description="PER77SYSCONFIG -  Peripheral System Configuration for CMPSS11">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPSS12" width="32" page="0" offset="0x6f8" instances="1" instaddr="4" internal="0" description="PER78SYSCONFIG -  Peripheral System Configuration for CMPSS12">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DACA" width="32" page="0" offset="0x6fc" instances="1" instaddr="4" internal="0" description="PER79SYSCONFIG -  Peripheral System Configuration for DACA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DACB" width="32" page="0" offset="0x700" instances="1" instaddr="4" internal="0" description="PER80SYSCONFIG -  Peripheral System Configuration for DACB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB1" width="32" page="0" offset="0x704" instances="1" instaddr="4" internal="0" description="PER81SYSCONFIG -  Peripheral System Configuration for CLB1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB2" width="32" page="0" offset="0x708" instances="1" instaddr="4" internal="0" description="PER82SYSCONFIG -  Peripheral System Configuration for CLB2">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
