ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="CLB3" width="32" page="0" offset="0x70c" instances="1" instaddr="4" internal="0" description="PER83SYSCONFIG -  Peripheral System Configuration for CLB3">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB4" width="32" page="0" offset="0x710" instances="1" instaddr="4" internal="0" description="PER84SYSCONFIG -  Peripheral System Configuration for CLB4">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB5" width="32" page="0" offset="0x714" instances="1" instaddr="4" internal="0" description="PER85SYSCONFIG -  Peripheral System Configuration for CLB5">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB6" width="32" page="0" offset="0x718" instances="1" instaddr="4" internal="0" description="PER86SYSCONFIG -  Peripheral System Configuration for CLB6">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSITXA" width="32" page="0" offset="0x71c" instances="1" instaddr="4" internal="0" description="PER87SYSCONFIG -  Peripheral System Configuration for FSITXA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSITXB" width="32" page="0" offset="0x720" instances="1" instaddr="4" internal="0" description="PER88SYSCONFIG -  Peripheral System Configuration for FSITXB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSITXC" width="32" page="0" offset="0x724" instances="1" instaddr="4" internal="0" description="PER89SYSCONFIG -  Peripheral System Configuration for FSITXC">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSITXD" width="32" page="0" offset="0x728" instances="1" instaddr="4" internal="0" description="PER90SYSCONFIG -  Peripheral System Configuration for FSITXD">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSIRXA" width="32" page="0" offset="0x72c" instances="1" instaddr="4" internal="0" description="PER91SYSCONFIG -  Peripheral System Configuration for FSIRXA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
