ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="FSIRXB" width="32" page="0" offset="0x730" instances="1" instaddr="4" internal="0" description="PER92SYSCONFIG -  Peripheral System Configuration for FSIRXB">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSIRXC" width="32" page="0" offset="0x734" instances="1" instaddr="4" internal="0" description="PER93SYSCONFIG -  Peripheral System Configuration for FSIRXC">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="FSIRXD" width="32" page="0" offset="0x738" instances="1" instaddr="4" internal="0" description="PER94SYSCONFIG -  Peripheral System Configuration for FSIRXD">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DCC1" width="32" page="0" offset="0x73c" instances="1" instaddr="4" internal="0" description="PER95SYSCONFIG -  Peripheral System Configuration for DCC1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DCC2" width="32" page="0" offset="0x740" instances="1" instaddr="4" internal="0" description="PER96SYSCONFIG -  Peripheral System Configuration for DCC2">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="DCC3" width="32" page="0" offset="0x744" instances="1" instaddr="4" internal="0" description="PER97SYSCONFIG -  Peripheral System Configuration for DCC3">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCATA" width="32" page="0" offset="0x748" instances="1" instaddr="4" internal="0" description="PER98SYSCONFIG -  Peripheral System Configuration for ETHERCATA">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="EPG1" width="32" page="0" offset="0x74c" instances="1" instaddr="4" internal="0" description="PER99SYSCONFIG -  Peripheral System Configuration for EPG1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SENT1" width="32" page="0" offset="0x750" instances="1" instaddr="4" internal="0" description="PER100SYSCONFIG -  Peripheral System Configuration for SENT1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
