ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_dev_cfg_regs.xml
	<register id="ADCCHECKER5" width="32" page="0" offset="0x778" instances="1" instaddr="4" internal="0" description="PER110SYSCONFIG -  Peripheral System Configuration for ADCCHECKER5">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCHECKER6" width="32" page="0" offset="0x77c" instances="1" instaddr="4" internal="0" description="PER111SYSCONFIG -  Peripheral System Configuration for ADCCHECKER6">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCHECKER7" width="32" page="0" offset="0x780" instances="1" instaddr="4" internal="0" description="PER112SYSCONFIG -  Peripheral System Configuration for ADCCHECKER7">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCHECKER8" width="32" page="0" offset="0x784" instances="1" instaddr="4" internal="0" description="PER113SYSCONFIG -  Peripheral System Configuration for ADCCHECKER8">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCHECKER9" width="32" page="0" offset="0x788" instances="1" instaddr="4" internal="0" description="PER114SYSCONFIG -  Peripheral System Configuration for ADCCHECKER9">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCHECKER10" width="32" page="0" offset="0x78c" instances="1" instaddr="4" internal="0" description="PER115SYSCONFIG -  Peripheral System Configuration for ADCCHECKER10">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSEAGGRCPU1" width="32" page="0" offset="0x790" instances="1" instaddr="4" internal="0" description="PER116SYSCONFIG -  Peripheral System Configuration for ADCSEAGGRCPU1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSEAGGRCPU2" width="32" page="0" offset="0x794" instances="1" instaddr="4" internal="0" description="PER117SYSCONFIG -  Peripheral System Configuration for ADCSEAGGRCPU2">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSEAGGRCPU3" width="32" page="0" offset="0x798" instances="1" instaddr="4" internal="0" description="PER118SYSCONFIG -  Peripheral System Configuration for ADCSEAGGRCPU3">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA1CH" width="32" page="0" offset="0x7a8" instances="1" instaddr="4" internal="0" description="PER122SYSCONFIG -  Peripheral System Configuration for RTDMA1CH">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA2CH" width="32" page="0" offset="0x7ac" instances="1" instaddr="4" internal="0" description="PER123SYSCONFIG -  Peripheral System Configuration for RTDMA2CH">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="WADI1" width="32" page="0" offset="0x7b0" instances="1" instaddr="4" internal="0" description="PER124SYSCONFIG -  Peripheral System Configuration for WADI1">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="WADI2" width="32" page="0" offset="0x7b4" instances="1" instaddr="4" internal="0" description="PER125SYSCONFIG -  Peripheral System Configuration for WADI2">
		<bitfield id="FRAMESEL" description="FRAMESEL Selection for Peripheral Instance" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CPUSEL" description="CPUSEL Selection for Peripheral Instance" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="STANDBYEN" description="STANDBYEN to enable peripheral clock gating based on CPUx" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBGHALTEN" description="DBGHALTEN to enable peripheral clock gating based on CPUx" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
